<!DOCTYPE html>
<html lang="zh" dir="ltr" class="client-nojs" xmlns="http://www.w3.org/1999/xhtml" xml:lang="zh">
<head><meta http-equiv="x-ua-compatible" content="ie=edge">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;</title>
<link rel="stylesheet" href="ext.css" />
<link rel="stylesheet" href="site_modules.css" />
</head>
<body class="mediawiki ltr sitedir-ltr ns-0 ns-subject page-cpp_language_adl skin-cppreference2 action-view cpp-navbar">
<div id="cpp-content-base">
<div id="content"><a id="top"></a>
<h1 id="firstHeading" class="firstHeading">&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;</h1>
<div id="bodyContent">
<div id="contentSub"><span class="subpages">&lt; <a href="cpp.html">cpp</a>&lrm; | <a href="cpp-language.html">language</a></span></div>
<div id="mw-content-text" lang="zh" dir="ltr" class="mw-content-ltr" xml:lang="zh">
<p><br /></p>
<p>&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;&#65288;ADL&#65289;&#65292;&#21448;&#31216; Koenig &#26597;&#25214;<sup id="cite_ref-1" class="reference"><a href="cpp-language-adl.html#cite_note-1">[1]</a></sup>&#65292;&#26159;&#19968;&#32452;&#23545;<a href="cpp-language-operator_other.html">&#20989;&#25968;&#35843;&#29992;&#34920;&#36798;&#24335;</a>&#65288;&#21253;&#25324;&#23545;<a href="cpp-language-operators.html">&#37325;&#36733;&#36816;&#31639;&#31526;</a>&#30340;&#38544;&#24335;&#20989;&#25968;&#35843;&#29992;&#65289;&#20013;&#30340;&#26080;&#38480;&#23450;&#30340;&#20989;&#25968;&#21517;&#36827;&#34892;&#26597;&#25214;&#30340;&#35268;&#21017;&#12290;&#22312;&#36890;&#24120;<a href="cpp-language-lookup.html">&#26080;&#38480;&#23450;&#21517;&#23383;&#26597;&#25214;</a>&#25152;&#32771;&#34385;&#30340;&#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;&#20043;&#22806;&#65292;&#36824;&#20250;&#22312;&#23427;&#30340;&#21508;&#20010;&#23454;&#21442;&#30340;&#21629;&#21517;&#31354;&#38388;&#20013;&#26597;&#25214;&#36825;&#20123;&#20989;&#25968;&#12290;</p>
<div class="t-example">
<p>&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;&#20351;&#24471;&#20351;&#29992;&#22312;&#19981;&#21516;&#21629;&#21517;&#31354;&#38388;&#23450;&#20041;&#30340;&#36816;&#31639;&#31526;&#25104;&#20026;&#21487;&#33021;&#12290;&#20363;&#22914;&#65306;</p>
<div class="t-example-live-link"></div>
<div dir="ltr" class="mw-geshi" style="text-align: left;">
<div class="cpp source-cpp">
<pre class="de1"><span class="co2">#include &lt;iostream&gt;</span>
<span class="kw4">int</span> main<span class="br0">(</span><span class="br0">)</span>
<span class="br0">{</span>
    <a href="cpp-io-cout.html"><span class="kw1762">std::<span class="me2">cout</span></span></a> <span class="sy1">&lt;&lt;</span> <span class="st0">&quot;&#27979;&#35797;<span class="es1">\n</span>&quot;</span><span class="sy4">;</span> <span class="co1">// &#20840;&#23616;&#21629;&#21517;&#31354;&#38388;&#20013;&#27809;&#26377; operator&lt;&lt;&#65292;&#20294; ADL &#26816;&#39564; std &#21629;&#21517;&#31354;&#38388;&#65292;</span>
                           <span class="co1">// &#22240;&#20026;&#24038;&#23454;&#21442;&#22312; std &#21629;&#21517;&#31354;&#38388;&#20013;</span>
                           <span class="co1">// &#24182;&#25214;&#21040; std::operator&lt;&lt;(std::ostream&amp;, const char*)</span>
    operator<span class="sy1">&lt;&lt;</span><span class="br0">(</span><a href="cpp-io-cout.html"><span class="kw1762">std::<span class="me2">cout</span></span></a>, <span class="st0">&quot;&#27979;&#35797;<span class="es1">\n</span>&quot;</span><span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#21516;&#19978;&#65292;&#29992;&#20989;&#25968;&#35843;&#29992;&#35760;&#27861;</span>
 
    <span class="co1">// &#28982;&#32780;&#65292;</span>
    <a href="cpp-io-cout.html"><span class="kw1762">std::<span class="me2">cout</span></span></a> <span class="sy1">&lt;&lt;</span> endl<span class="sy4">;</span> <span class="co1">// &#38169;&#35823;&#65306;&ldquo;endl&rdquo; &#26410;&#22312;&#27492;&#21629;&#21517;&#31354;&#38388;&#20013;&#22768;&#26126;&#12290;</span>
                       <span class="co1">// &#36825;&#19981;&#26159;&#23545; endl() &#30340;&#20989;&#25968;&#35843;&#29992;&#65292;&#25152;&#20197;&#19981;&#36866;&#29992; ADL</span>
 
    endl<span class="br0">(</span><a href="cpp-io-cout.html"><span class="kw1762">std::<span class="me2">cout</span></span></a><span class="br0">)</span><span class="sy4">;</span> <span class="co1">// OK&#65306;&#36825;&#26159;&#20989;&#25968;&#35843;&#29992;&#65306;ADL &#26816;&#39564; std &#21629;&#21517;&#31354;&#38388;&#65292;</span>
                     <span class="co1">// &#22240;&#20026; endl &#30340;&#23454;&#21442;&#22312; std &#20013;&#65292;&#24182;&#25214;&#21040;&#20102; std::endl</span>
 
    <span class="br0">(</span>endl<span class="br0">)</span><span class="br0">(</span><a href="cpp-io-cout.html"><span class="kw1762">std::<span class="me2">cout</span></span></a><span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#38169;&#35823;&#65306;&ldquo;endl&rdquo; &#26410;&#22312;&#27492;&#21629;&#21517;&#31354;&#38388;&#22768;&#26126;&#12290;</span>
                       <span class="co1">// &#23376;&#34920;&#36798;&#24335; (endl) &#19981;&#26159;&#20989;&#25968;&#35843;&#29992;&#34920;&#36798;&#24335;</span>
<span class="br0">}</span></pre></div>
</div>
</div>
<h3><span class="mw-headline" id=".E7.BB.86.E8.8A.82">&#32454;&#33410;</span></h3>
<p>&#39318;&#20808;&#65292;&#22914;&#26524;&#36890;&#24120;&#30340;<a href="cpp-language-lookup.html">&#26080;&#38480;&#23450;&#26597;&#25214;</a>&#25152;&#29983;&#25104;&#30340;&#38598;&#21512;&#21547;&#26377;&#19979;&#21015;&#20219;&#20309;&#20869;&#23481;&#65292;&#37027;&#20040;&#19981;&#32771;&#34385;&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;:</p>
<div class="t-li1"><span class="t-li">1)</span> &#31867;&#25104;&#21592;&#30340;&#22768;&#26126;&#12290;</div>
<div class="t-li1"><span class="t-li">2)</span> &#22359;&#20316;&#29992;&#22495;&#30340;&#65288;&#38750; <a href="cpp-language-namespace.html#using_.E5.A3.B0.E6.98.8E"><span class="mw-geshi cpp source-cpp"><span class="kw1">using</span></span> &#22768;&#26126;</a>&#30340;&#65289;&#20989;&#25968;&#22768;&#26126;&#12290;</div>
<div class="t-li1"><span class="t-li">3)</span> &#20219;&#20309;&#38750;&#20989;&#25968;&#25110;&#20989;&#25968;&#27169;&#26495;&#30340;&#22768;&#26126;&#65288;&#20363;&#22914;&#20989;&#25968;&#23545;&#35937;&#25110;&#21478;&#19968;&#21464;&#37327;&#65292;&#23427;&#30340;&#21517;&#23383;&#19982;&#27491;&#22312;&#26597;&#25214;&#30340;&#20989;&#25968;&#21517;&#20914;&#31361;&#65289;&#12290;</div>
<p>&#21542;&#21017;&#65292;&#23545;&#20110;&#27599;&#20010;&#20989;&#25968;&#35843;&#29992;&#34920;&#36798;&#24335;&#20013;&#30340;&#23454;&#21442;&#65292;&#26816;&#39564;&#23427;&#30340;&#31867;&#22411;&#65292;&#20197;&#30830;&#23450;&#23427;&#23558;&#21521;&#26597;&#25214;&#25152;&#28155;&#21152;&#30340;<i>&#21629;&#21517;&#31354;&#38388;&#19982;&#31867;&#30340;&#20851;&#32852;&#38598;</i>&#12290;</p>
<div class="t-li1"><span class="t-li">1)</span> &#23545;&#20110;&#22522;&#30784;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#21629;&#21517;&#31354;&#38388;&#19982;&#31867;&#30340;&#20851;&#32852;&#38598;&#26159;&#31354;&#38598;&#12290;</div>
<div class="t-li1"><span class="t-li">2)</span> &#23545;&#20110;&#31867;&#31867;&#22411;&#65288;&#21547;&#32852;&#21512;&#20307;&#65289;&#30340;&#23454;&#21442;&#65292;&#38598;&#21512;&#30001;&#20197;&#19979;&#32452;&#25104;&#65306;</div>
<div class="t-li2"><span class="t-li">a)</span> &#35813;&#31867;&#33258;&#36523;&#12290;</div>
<div class="t-li2"><span class="t-li">b)</span> &#22914;&#26524;&#35813;&#31867;&#31867;&#22411;&#26159;<a href="cpp-language-type.html#.E4.B8.8D.E5.AE.8C.E6.95.B4.E7.B1.BB.E5.9E.8B">&#23436;&#25972;&#31867;&#22411;</a>&#65292;&#23427;&#25152;&#26377;&#30340;&#30452;&#25509;&#19982;&#38388;&#25509;&#22522;&#31867;&#12290;</div>
<div class="t-li2"><span class="t-li">c)</span> &#22914;&#26524;&#35813;&#31867;&#26159;<a href="cpp-language-nested_types.html">&#21478;&#19968;&#31867;&#30340;&#25104;&#21592;</a>&#65292;&#23427;&#30340;&#22806;&#22260;&#31867;&#12290;</div>
<div class="t-li2"><span class="t-li">d)</span> &#28155;&#21152;&#21040;&#38598;&#21512;&#30340;&#21508;&#20010;&#31867;&#30340;&#26368;&#20869;&#23618;&#22806;&#22260;&#21629;&#21517;&#31354;&#38388;&#12290;</div>
<div class="t-li1"><span class="t-li">3)</span> &#23545;&#20110;&#31867;&#22411;&#26159;<a href="cpp-language-class_template.html">&#31867;&#27169;&#26495;</a>&#30340;&#29305;&#21270;&#30340;&#23454;&#21442;&#65292;&#22312;&#19978;&#36848;&#20851;&#20110;&#31867;&#30340;&#35268;&#21017;&#22806;&#65292;&#36824;&#23558;&#20197;&#19979;&#20851;&#32852;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#28155;&#21152;&#21040;&#38598;&#21512;&#20013;&#65306;</div>
<div class="t-li2"><span class="t-li">a)</span> &#20026;&#21508;&#31867;&#22411;&#27169;&#26495;&#24418;&#21442;&#25552;&#20379;&#30340;&#25152;&#26377;&#27169;&#26495;&#23454;&#21442;&#30340;&#31867;&#22411;&#65288;&#36339;&#36807;&#38750;&#31867;&#22411;&#27169;&#26495;&#24418;&#21442;&#21644;&#27169;&#26495;&#27169;&#26495;&#24418;&#21442;&#65289;&#12290;</div>
<div class="t-li2"><span class="t-li">b)</span> &#20197;&#20219;&#20309;&#27169;&#26495;&#27169;&#26495;&#23454;&#21442;&#20026;&#20854;&#20013;&#25104;&#21592;&#30340;&#21629;&#21517;&#31354;&#38388;&#12290;</div>
<div class="t-li2"><span class="t-li">c)</span> &#20197;&#20219;&#20309;&#27169;&#26495;&#27169;&#26495;&#23454;&#21442;&#20026;&#20854;&#20013;&#25104;&#21592;&#30340;&#31867;&#65288;&#22914;&#26524;&#23427;&#20204;&#26159;&#31867;&#25104;&#21592;&#27169;&#26495;&#65289;&#12290;</div>
<div class="t-li1"><span class="t-li">4)</span> &#23545;&#20110;&#20219;&#20309;&#26522;&#20030;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#35813;&#26522;&#20030;&#31867;&#22411;&#30340;&#22768;&#26126;&#30340;&#26368;&#20869;&#23618;&#22806;&#22260;&#21629;&#21517;&#31354;&#38388;&#12290;&#22914;&#26524;&#35813;&#26522;&#20030;&#31867;&#22411;&#26159;&#31867;&#25104;&#21592;&#65292;&#37027;&#20040;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#35813;&#31867;&#12290;</div>
<div class="t-li1"><span class="t-li">5)</span> &#23545;&#20110; <code>T</code> &#30340;&#25351;&#38024;&#25110;&#25351;&#21521; <code>T</code> &#30340;&#25968;&#32452;&#30340;&#25351;&#38024;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#26816;&#39564;&#31867;&#22411; <code>T</code> &#24182;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#23427;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;</div>
<div class="t-li1"><span class="t-li">6)</span> &#23545;&#20110;&#20989;&#25968;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#26816;&#39564;&#21508;&#20989;&#25968;&#24418;&#21442;&#31867;&#22411;&#19982;&#20989;&#25968;&#36820;&#22238;&#20540;&#31867;&#22411;&#65292;&#24182;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#23427;&#20204;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;</div>
<div class="t-li1"><span class="t-li">7)</span> &#23545;&#20110;&#25351;&#21521;&#31867; <code>X</code> &#30340;&#25104;&#21592;&#20989;&#25968; <code>F</code> &#30340;&#25351;&#38024;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#26816;&#39564;&#21508;&#20989;&#25968;&#24418;&#21442;&#31867;&#22411;&#12289;&#20989;&#25968;&#36820;&#22238;&#20540;&#31867;&#22411;&#21450;&#31867; <code>X</code>&#65292;&#24182;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#23427;&#20204;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;</div>
<div class="t-li1"><span class="t-li">8)</span> &#23545;&#20110;&#25351;&#21521;&#31867; <code>X</code> &#30340;&#25968;&#25454;&#25104;&#21592; <code>T</code> &#30340;&#25351;&#38024;&#31867;&#22411;&#30340;&#23454;&#21442;&#65292;&#26816;&#39564;&#35813;&#25104;&#21592;&#31867;&#22411;&#21644;&#31867;&#22411; <code>X</code>&#65292;&#24182;&#21521;&#38598;&#21512;&#28155;&#21152;&#23427;&#20204;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;</div>
<div class="t-li1"><span class="t-li">9)</span> &#22914;&#26524;&#23454;&#21442;&#26159;<a href="cpp-language-overloaded_address.html">&#19968;&#32452;&#37325;&#36733;&#20989;&#25968;&#65288;&#25110;&#20989;&#25968;&#27169;&#26495;&#65289;&#30340;&#21517;&#23383;&#25110;&#21462;&#22336;&#34920;&#36798;&#24335;</a>&#65292;&#37027;&#20040;&#26816;&#39564;&#37325;&#36733;&#38598;&#21512;&#20013;&#30340;&#27599;&#20010;&#20989;&#25968;&#65292;&#24182;&#21521;&#38598;&#21512;&#28155;&#21152;&#23427;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;
<ul>
<li>&#21478;&#22806;&#65292;&#22914;&#26524;&#20197;<a href="cpp-language-templates.html#.E6.A8.A1.E6.9D.BF.E6.A0.87.E8.AF.86">&#27169;&#26495;&#26631;&#35782;</a>&#65288;&#24102;&#27169;&#26495;&#23454;&#21442;&#30340;&#27169;&#26495;&#21517;&#65289;&#25351;&#21517;&#37325;&#36733;&#38598;&#65292;&#37027;&#20040;&#26816;&#39564;&#23427;&#30340;&#25152;&#26377;&#31867;&#22411;&#27169;&#26495;&#23454;&#21442;&#19982;&#27169;&#26495;&#27169;&#26495;&#23454;&#21442;&#65288;&#20294;&#19981;&#21253;&#25324;&#38750;&#31867;&#22411;&#27169;&#26495;&#23454;&#21442;&#65289;&#65292;&#24182;&#21521;&#38598;&#21512;&#28155;&#21152;&#23427;&#30340;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;</li>
</ul>
</div>
<table class="t-rev-begin">
<tr class="t-rev t-since-cxx11">
<td>
<p>&#22914;&#26524;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#20013;&#30340;&#20219;&#20309;&#21629;&#21517;&#31354;&#38388;&#26159;<a href="cpp-language-namespace.html">&#20869;&#32852;&#21629;&#21517;&#31354;&#38388;</a>&#65292;&#37027;&#20040;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#23427;&#30340;&#22806;&#22260;&#21629;&#21517;&#31354;&#38388;&#12290;</p>
<p>&#22914;&#26524;&#31867;&#19982;&#21629;&#21517;&#31354;&#38388;&#30340;&#20851;&#32852;&#38598;&#21512;&#20013;&#30340;&#20219;&#20309;&#21629;&#21517;&#31354;&#38388;&#30452;&#25509;&#21547;&#26377;&#20869;&#32852;&#21629;&#21517;&#31354;&#38388;&#65292;&#37027;&#20040;&#21521;&#38598;&#21512;&#20013;&#28155;&#21152;&#35813;&#20869;&#32852;&#21629;&#21517;&#31354;&#38388;&#12290;</p>
</td>
<td><span class="t-mark-rev t-since-cxx11" style="white-space: nowrap;">(C++11 &#36215;)</span></td>
</tr>
</table>
<p>&#22312;&#30830;&#23450;&#21629;&#21517;&#31354;&#38388;&#19982;&#31867;&#30340;&#20851;&#32852;&#38598;&#21512;&#21518;&#65292;&#20026;&#20102;&#36827;&#19968;&#27493;&#30340; ADL &#22788;&#29702;&#65292;&#24573;&#30053;&#27492;&#38598;&#20013;&#25152;&#26377;&#22312;&#31867;&#20013;&#25214;&#21040;&#30340;&#22768;&#26126;&#65292;&#20294;&#19981;&#21253;&#25324;&#21629;&#21517;&#31354;&#38388;&#20316;&#29992;&#22495;&#30340;&#21451;&#20803;&#20989;&#25968;&#21450;&#20989;&#25968;&#27169;&#26495;&#65292;&#22312;&#21518;&#36848;&#28857; 2 &#38472;&#36848;&#12290;</p>
<p>&#26681;&#25454;&#19979;&#21015;&#29305;&#27530;&#35268;&#21017;&#65292;&#23558;&#36890;&#36807;&#24120;&#35268;<a href="cpp-language-lookup.html">&#26080;&#38480;&#23450;&#26597;&#25214;</a>&#25152;&#25214;&#21040;&#30340;&#22768;&#26126;&#30340;&#38598;&#21512;&#65292;&#19982;&#36890;&#36807; ADL &#25152;&#29983;&#25104;&#30340;&#20851;&#32852;&#38598;&#21512;&#30340;&#25152;&#26377;&#20803;&#32032;&#20013;&#25214;&#21040;&#30340;&#22768;&#26126;&#38598;&#21512;&#36827;&#34892;&#21512;&#24182;&#65306;</p>
<div class="t-li1"><span class="t-li">1)</span> &#24573;&#30053;&#20851;&#32852;&#21629;&#21517;&#31354;&#38388;&#20013;&#30340; <a href="cpp-language-namespace.html#using_.E6.8C.87.E4.BB.A4"><span class="mw-geshi cpp source-cpp"><span class="kw1">using</span></span> &#25351;&#20196;</a>&#12290;</div>
<div class="t-li1"><span class="t-li">2)</span> &#22312;&#20851;&#32852;&#31867;&#20013;&#30340;&#21629;&#21517;&#31354;&#38388;&#20316;&#29992;&#22495;&#22768;&#26126;&#30340;&#21451;&#20803;&#20989;&#25968;&#65288;&#21450;&#20989;&#25968;&#27169;&#26495;&#65289;&#36890;&#36807; ADL &#21487;&#35265;&#65292;&#21363;&#20351;&#23427;&#20204;&#36890;&#36807;&#26222;&#36890;&#26597;&#25214;&#19981;&#21487;&#35265;&#12290;</div>
<div class="t-li1"><span class="t-li">3)</span> &#24573;&#30053;&#38500;&#20989;&#25968;&#19982;&#20989;&#25968;&#27169;&#26495;&#22806;&#30340;&#25152;&#26377;&#21517;&#23383;&#65288;&#19981;&#20250;&#19982;&#21464;&#37327;&#20043;&#38388;&#21457;&#29983;&#20914;&#31361;&#65289;&#12290;</div>
<h3><span class="mw-headline" id=".E6.B3.A8.E8.A7.A3">&#27880;&#35299;</span></h3>
<p>&#22240;&#20026;&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;&#65292;&#22312;&#30456;&#21516;&#21629;&#21517;&#31354;&#38388;&#23450;&#20041;&#30340;&#38750;&#25104;&#21592;&#20989;&#25968;&#21644;&#38750;&#25104;&#21592;&#36816;&#31639;&#31526;&#34987;&#35748;&#20026;&#26159;&#35813;&#31867;&#20844;&#24320;&#25509;&#21475;&#30340;&#19968;&#37096;&#20998;&#65288;&#22914;&#26524;&#23427;&#20204;&#34987; ADL &#25214;&#21040;&#65289;<sup id="cite_ref-2" class="reference"><a href="cpp-language-adl.html#cite_note-2">[2]</a></sup>&#12290;</p>
<p>ADL &#26159;&#22312;&#27867;&#22411;&#20195;&#30721;&#20013;&#20026;&#20132;&#25442;&#20004;&#20010;&#23545;&#35937;&#32780;&#24314;&#31435;&#30340;&#25163;&#27861;&#33021;&#25104;&#31435;&#30340;&#21407;&#22240;&#65306;<span class="t-c"><span class="mw-geshi cpp source-cpp"><span class="kw1">using</span> <a href="cpp-algorithm-swap.html"><span class="kw1603">std::<span class="me2">swap</span></span></a><span class="sy4">;</span> swap<span class="br0">(</span>obj1, obj2<span class="br0">)</span><span class="sy4">;</span></span></span> &#22240;&#20026;&#30452;&#25509;&#35843;&#29992; <span class="t-c"><span class="mw-geshi cpp source-cpp"><a href="cpp-algorithm-swap.html"><span class="kw1603">std::<span class="me2">swap</span></span></a><span class="br0">(</span>obj1, obj2<span class="br0">)</span></span></span> &#19981;&#20250;&#32771;&#34385;&#19982; <span class="t-c"><span class="mw-geshi cpp source-cpp">obj1</span></span> &#25110; <span class="t-c"><span class="mw-geshi cpp source-cpp">obj2</span></span> &#31867;&#22411;&#30340;&#23450;&#20041;&#22312;&#21516;&#19968;&#21629;&#21517;&#31354;&#38388;&#30340;&#29992;&#25143;&#23450;&#20041;&#30340; <code>swap()</code> &#20989;&#25968;&#23450;&#20041;&#65292;&#32780;&#20165;&#35843;&#29992;&#26080;&#38480;&#23450;&#30340; <span class="t-c"><span class="mw-geshi cpp source-cpp">swap<span class="br0">(</span>obj1, obj2<span class="br0">)</span></span></span>&#20250;&#22312;&#27809;&#26377;&#29992;&#25143;&#23450;&#20041;&#37325;&#36733;&#26102;&#26080;&#27861;&#35843;&#29992;&#20219;&#20309;&#20989;&#25968;&#12290;&#29305;&#21035;&#26159; <span class="t-lc"><a href="cpp-algorithm-iter_swap.html">std::iter_swap</a></span> &#19982;&#25152;&#26377;&#20854;&#20182;&#26631;&#20934;&#24211;&#31639;&#27861;&#22312;&#22788;&#29702;<a href="cpp-named_req-Swappable.html">&#21487;&#20132;&#25442;</a>&#31867;&#22411;&#26102;&#20351;&#29992;&#27492;&#25163;&#27573;&#12290;</p>
<p>&#21517;&#23383;&#26597;&#25214;&#35268;&#21017;&#20351;&#24471;&#22312;&#20840;&#23616;&#25110;&#29992;&#25143;&#23450;&#20041;&#21629;&#21517;&#31354;&#38388;&#20013;&#22768;&#26126;&#23545;&#26469;&#33258; <code>std</code> &#21629;&#21517;&#31354;&#38388;&#30340;&#31867;&#22411;&#36827;&#34892;&#25805;&#20316;&#30340;&#36816;&#31639;&#31526;&#21464;&#24471;&#19981;&#20999;&#23454;&#38469;&#65292;&#20363;&#22914;&#65292;&#23545;&#20110; <span class="t-lc"><a href="cpp-container-vector.html">std::vector</a></span> &#25110; <span class="t-lc"><a href="cpp-utility-pair.html">std::pair</a></span> &#30340;&#33258;&#23450;&#20041; <span class="t-c"><span class="mw-geshi cpp source-cpp">operator<span class="sy2">+</span></span></span> &#25110; <span class="t-c"><span class="mw-geshi cpp source-cpp">operator<span class="sy1">&gt;&gt;</span></span></span>&#65288;&#38500;&#38750; vector/pair &#30340;&#20803;&#32032;&#31867;&#22411;&#26159;&#29992;&#25143;&#23450;&#20041;&#31867;&#22411;&#65292;&#36825;&#20250;&#23558;&#23427;&#30340;&#21629;&#21517;&#31354;&#38388;&#28155;&#21152;&#21040; ADL &#20013;&#65289;&#12290;&#36825;&#31181;&#36816;&#31639;&#31526;&#19981;&#20250;&#20174;&#35832;&#22914;&#26631;&#20934;&#24211;&#31639;&#27861;&#30340;&#27169;&#26495;&#23454;&#20363;&#21270;&#20013;&#34987;&#26597;&#25214;&#21040;&#12290;&#36827;&#19968;&#27493;&#32454;&#33410;&#35265;<a href="cpp-language-dependent_name.html">&#24453;&#20915;&#21517;</a>&#12290;</p>
<p>ADL &#33021;&#25214;&#21040;&#23436;&#20840;&#22312;&#31867;&#25110;&#31867;&#27169;&#26495;&#20869;&#23450;&#20041;&#30340;<a href="cpp-language-friend.html">&#21451;&#20803;&#20989;&#25968;</a>&#65288;&#20856;&#22411;&#30340;&#20363;&#23376;&#26159;&#37325;&#36733;&#30340;&#36816;&#31639;&#31526;&#65289;&#65292;&#21363;&#20351;&#23427;&#22987;&#32456;&#26410;&#22312;&#21629;&#21517;&#31354;&#38388;&#23618;&#27425;&#36827;&#34892;&#22768;&#26126;&#12290;</p>
<div dir="ltr" class="mw-geshi" style="text-align: left;">
<div class="cpp source-cpp">
<pre class="de1"><span class="kw1">template</span><span class="sy1">&lt;</span><span class="kw1">typename</span> T<span class="sy1">&gt;</span>
<span class="kw1">struct</span> number
<span class="br0">{</span>
    number<span class="br0">(</span><span class="kw4">int</span><span class="br0">)</span><span class="sy4">;</span>
    <span class="kw1">friend</span> number gcd<span class="br0">(</span>number x, number y<span class="br0">)</span> <span class="br0">{</span> <span class="kw1">return</span> <span class="nu0">0</span><span class="sy4">;</span> <span class="br0">}</span><span class="sy4">;</span> <span class="co1">// &#31867;&#27169;&#26495;&#20869;&#30340;&#23450;&#20041;</span>
<span class="br0">}</span><span class="sy4">;</span>
 
<span class="co1">// &#38500;&#38750;&#25552;&#20379;&#21305;&#37197;&#22768;&#26126;&#65292;&#21542;&#21017; gcd &#26159;&#27492;&#21629;&#21517;&#31354;&#38388;&#30340;&#19981;&#21487;&#35265;&#25104;&#21592;&#65288;&#38500;&#38750;&#36890;&#36807; ADL&#65289;</span>
<span class="kw4">void</span> g<span class="br0">(</span><span class="br0">)</span>
<span class="br0">{</span>
    number<span class="sy1">&lt;</span><span class="kw4">double</span><span class="sy1">&gt;</span> a<span class="br0">(</span><span class="nu0">3</span><span class="br0">)</span>, b<span class="br0">(</span><span class="nu0">4</span><span class="br0">)</span><span class="sy4">;</span>
    a <span class="sy1">=</span> gcd<span class="br0">(</span>a,b<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#25214;&#21040; gcd &#65292;&#22240;&#20026; number&lt;double&gt; &#26159;&#20851;&#32852;&#31867;&#65292;</span>
                  <span class="co1">// &#20351; gcd &#22312;&#23427;&#30340;&#21629;&#21517;&#31354;&#38388;&#65288;&#20840;&#23616;&#21629;&#21517;&#31354;&#38388;&#65289;&#21487;&#35265;</span>
<span class="co1">//  b = gcd(3,4); // &#38169;&#35823;&#65306;gcd &#19981;&#21487;&#35265;</span>
<span class="br0">}</span></pre></div>
</div>
<table class="t-rev-begin">
<tr class="t-rev t-until-cxx20">
<td>
<p>&#23613;&#31649;&#26222;&#36890;&#26597;&#25214;&#22312;&#25214;&#19981;&#21040;&#32467;&#26524;&#26102;&#20063;&#33021;&#36890;&#36807; ADL &#35299;&#26512;&#20989;&#25968;&#35843;&#29992;&#65292;&#20294;&#26159;&#23545;&#24102;&#26174;&#24335;&#25351;&#23450;&#27169;&#26495;&#23454;&#21442;&#30340;<a href="cpp-language-function_template.html">&#20989;&#25968;&#27169;&#26495;</a>&#35843;&#29992;&#36824;&#26159;&#35201;&#27714;&#23384;&#22312;&#26222;&#36890;&#26597;&#25214;&#25152;&#33021;&#25214;&#21040;&#30340;&#27169;&#26495;&#22768;&#26126;&#65288;&#21542;&#21017;&#65292;&#23427;&#23558;&#26159;&#36935;&#21040;&#26410;&#30693;&#21517;&#23383;&#21518;&#38543;&#23567;&#20110;&#21495;&#30340;&#35821;&#27861;&#38169;&#35823;&#65289;&#65306;</p>
<div dir="ltr" class="mw-geshi" style="text-align: left;">
<div class="cpp source-cpp">
<pre class="de1"><span class="kw1">namespace</span> N1
<span class="br0">{</span>
    <span class="kw1">struct</span> S <span class="br0">{</span><span class="br0">}</span><span class="sy4">;</span>
 
    <span class="kw1">template</span><span class="sy1">&lt;</span><span class="kw4">int</span> X<span class="sy1">&gt;</span>
    <span class="kw4">void</span> f<span class="br0">(</span>S<span class="br0">)</span><span class="sy4">;</span>
<span class="br0">}</span>
 
<span class="kw1">namespace</span> N2
<span class="br0">{</span>
    <span class="kw1">template</span><span class="sy1">&lt;</span><span class="kw1">class</span> T<span class="sy1">&gt;</span>
    <span class="kw4">void</span> f<span class="br0">(</span>T t<span class="br0">)</span><span class="sy4">;</span>
<span class="br0">}</span>
 
<span class="kw4">void</span> g<span class="br0">(</span>N1<span class="sy4">::</span><span class="me2">S</span> s<span class="br0">)</span>
<span class="br0">{</span>
    f<span class="sy1">&lt;</span><span class="nu0">3</span><span class="sy1">&gt;</span><span class="br0">(</span>s<span class="br0">)</span><span class="sy4">;</span>     <span class="co1">// C++20 &#21069;&#26159;&#35821;&#27861;&#38169;&#35823;&#65288;&#26080;&#38480;&#23450;&#26597;&#25214;&#25214;&#19981;&#21040; f&#65289;</span>
    N1<span class="sy4">::</span><span class="me2">f</span><span class="sy1">&lt;</span><span class="nu0">3</span><span class="sy1">&gt;</span><span class="br0">(</span>s<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// OK&#65292;&#26377;&#38480;&#23450;&#26597;&#25214;&#25214;&#21040;&#27169;&#26495; &#39;f&#39;</span>
    N2<span class="sy4">::</span><span class="me2">f</span><span class="sy1">&lt;</span><span class="nu0">3</span><span class="sy1">&gt;</span><span class="br0">(</span>s<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#38169;&#35823;&#65306; N2::f &#19981;&#25509;&#25910;&#38750;&#31867;&#22411;&#27169;&#26495;&#24418;&#21442;</span>
                 <span class="co1">//       N1::f &#19981;&#33021;&#34987;&#25214;&#21040;&#65292;&#22240;&#20026; ADL &#20165;&#36866;&#29992;&#20110;&#26080;&#38480;&#23450;&#21517;</span>
 
    <span class="kw1">using</span> N2<span class="sy4">::</span><span class="me2">f</span><span class="sy4">;</span>
    f<span class="sy1">&lt;</span><span class="nu0">3</span><span class="sy1">&gt;</span><span class="br0">(</span>s<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// OK&#65306;&#26080;&#38480;&#23450;&#26597;&#25214;&#29616;&#22312;&#25214;&#21040; N2::f&#65292;</span>
             <span class="co1">//     &#28982;&#21518;&#22240;&#20026;&#27492;&#21517;&#26080;&#38480;&#23450;&#25152;&#20197; ADL &#34920;&#24577;&#24182;&#25214;&#21040; N1::f</span>
<span class="br0">}</span></pre></div>
</div>
</td>
<td><span class="t-mark-rev t-until-cxx20" style="white-space: nowrap;">(C++20 &#21069;)</span></td>
</tr>
</table>
<p>&#19979;&#21015;&#35821;&#22659;&#20043;&#20013;&#36827;&#34892; ADL&#65288;&#21363;&#20165;&#22312;&#20851;&#32852;&#30340;&#21629;&#21517;&#31354;&#38388;&#20013;&#26597;&#25214;&#65289;&#65306;</p>
<table class="t-rev-begin">
<tr class="t-rev t-since-cxx11">
<td>
<ul>
<li>&#23545; <a href="cpp-language-range-for.html">&#33539;&#22260; for</a> &#24490;&#29615;&#65292;&#25104;&#21592;&#26597;&#25214;&#22833;&#36133;&#26102;&#65292;&#26597;&#25214;&#38750;&#25104;&#21592;&#20989;&#25968; <code>begin</code> &#19982; <code>end</code>&#12290;</li>
</ul>
</td>
<td><span class="t-mark-rev t-since-cxx11" style="white-space: nowrap;">(C++11 &#36215;)</span></td>
</tr>
</table>
<ul>
<li>&#20174;&#27169;&#26495;&#23454;&#20363;&#21270;&#28857;&#36827;&#34892;<a href="cpp-language-dependent_name.html#.E6.9F.A5.E6.89.BE.E8.A7.84.E5.88.99">&#24453;&#20915;&#21517;&#26597;&#25214;</a>&#12290;</li>
</ul>
<table class="t-rev-begin">
<tr class="t-rev t-since-cxx17">
<td>
<ul>
<li><a href="cpp-language-structured_binding.html">&#32467;&#26500;&#21270;&#32465;&#23450;&#22768;&#26126;</a>&#23545;&#20803;&#32452;&#24335;&#31867;&#22411;&#26597;&#25214;&#38750;&#25104;&#21592;&#20989;&#25968; <code>get</code>&#12290;</li>
</ul>
</td>
<td><span class="t-mark-rev t-since-cxx17" style="white-space: nowrap;">(C++17 &#36215;)</span></td>
</tr>
</table>
<h3><span class="mw-headline" id=".E7.A4.BA.E4.BE.8B">&#31034;&#20363;</span></h3>
<table class="metadata plainlinks ambox mbox-small-left ambox-notice" style="">
<tr>
<td class="mbox-empty-cell"></td>
<td class="mbox-text" style="">&#26412;&#33410;&#26410;&#23436;&#25104;<br />
&#21407;&#22240;&#65306;&#26356;&#22810;&#31034;&#20363;</td>
</tr>
</table>
<div class="t-example">
<p>&#26469;&#33258; <a rel="nofollow" class="external free" href="http://www.gotw.ca/gotw/030.htm">http://www.gotw.ca/gotw/030.htm</a> &#30340;&#31034;&#20363;</p>
<div class="t-example-live-link"></div>
<div dir="ltr" class="mw-geshi" style="text-align: left;">
<div class="cpp source-cpp">
<pre class="de1"><span class="kw1">namespace</span> A
<span class="br0">{</span>
    <span class="kw1">struct</span> X<span class="sy4">;</span>
    <span class="kw1">struct</span> Y<span class="sy4">;</span>
 
    <span class="kw4">void</span> f<span class="br0">(</span><span class="kw4">int</span><span class="br0">)</span><span class="sy4">;</span>
    <span class="kw4">void</span> g<span class="br0">(</span>X<span class="br0">)</span><span class="sy4">;</span>
<span class="br0">}</span>
 
<span class="kw1">namespace</span> B
<span class="br0">{</span>
    <span class="kw4">void</span> f<span class="br0">(</span><span class="kw4">int</span> i<span class="br0">)</span>
    <span class="br0">{</span>
        f<span class="br0">(</span>i<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#35843;&#29992; B::f&#65288;&#26080;&#38480;&#36882;&#24402;&#65289;</span>
    <span class="br0">}</span>
 
    <span class="kw4">void</span> g<span class="br0">(</span>A<span class="sy4">::</span><span class="me2">X</span> x<span class="br0">)</span>
    <span class="br0">{</span>
        g<span class="br0">(</span>x<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#38169;&#35823;&#65306;&#22312; B::g&#65288;&#24120;&#35268;&#26597;&#25214;&#65289;&#19982; A::g&#65288;&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;&#65289;&#38388;&#26377;&#27495;&#20041;</span>
    <span class="br0">}</span>
 
    <span class="kw4">void</span> h<span class="br0">(</span>A<span class="sy4">::</span><span class="me2">Y</span> y<span class="br0">)</span>
    <span class="br0">{</span>
        h<span class="br0">(</span>y<span class="br0">)</span><span class="sy4">;</span> <span class="co1">// &#35843;&#29992; B::h&#65288;&#26080;&#38480;&#36882;&#24402;&#65289;&#65306;ADL &#26816;&#39564;&#21629;&#21517;&#31354;&#38388; A</span>
              <span class="co1">// &#20294;&#26159;&#25214;&#19981;&#21040; A::h&#65292;&#25152;&#20197;&#21482;&#37319;&#29992;&#26469;&#33258;&#24120;&#35268;&#26597;&#25214;&#30340; B::h</span>
    <span class="br0">}</span>
<span class="br0">}</span></pre></div>
</div>
</div>
<h3><span class="mw-headline" id=".E7.BC.BA.E9.99.B7.E6.8A.A5.E5.91.8A">&#32570;&#38519;&#25253;&#21578;</span></h3>
<p>&#19979;&#21015;&#26356;&#25913;&#34892;&#20026;&#30340;&#32570;&#38519;&#25253;&#21578;&#36861;&#28335;&#22320;&#24212;&#29992;&#20110;&#20197;&#21069;&#20986;&#29256;&#30340; C++ &#26631;&#20934;&#12290;</p>
<table class="dsctable" style="font-size:0.8em">
<tr>
<th>&#32570;&#38519;&#25253;&#21578;</th>
<th>&#24212;&#29992;&#20110;</th>
<th>&#20986;&#29256;&#26102;&#30340;&#34892;&#20026;</th>
<th>&#27491;&#30830;&#34892;&#20026;</th>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/33.html">CWG 33</a></td>
<td>C++98</td>
<td>&#24403;&#29992;&#20110;&#26597;&#25214;&#30340;&#23454;&#21442;&#26159;&#37325;&#36733;&#20989;&#25968;&#25110;&#20989;&#25968;&#27169;&#26495;&#30340;&#22320;&#22336;&#26102;&#65292;&#20851;&#32852;&#30340;&#21629;&#21517;&#31354;&#38388;&#21644;&#31867;&#26410;&#25351;&#26126;</td>
<td>&#25351;&#26126;&#23427;&#20204;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/90.html">CWG 90</a></td>
<td>C++98</td>
<td>&#23884;&#22871;&#30340;&#38750;&#32852;&#21512;&#20307;&#31867;&#30340;&#31867;&#20851;&#32852;&#38598;&#19981;&#21253;&#21547;&#35813;&#31867;&#30340;&#22806;&#22260;&#31867;&#65292;&#20294;&#23884;&#22871;&#32852;&#21512;&#20307;&#19982;&#23427;&#30340;&#22806;&#22260;&#31867;&#20851;&#32852;</td>
<td>&#25152;&#26377;&#23884;&#22871;&#31867;&#37117;&#20851;&#32852;&#23545;&#24212;&#22806;&#22260;&#31867;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/239.html">CWG 239</a></td>
<td>C++98</td>
<td>&#21363;&#20351;&#36890;&#24120;&#30340;&#26080;&#38480;&#23450;&#26597;&#25214;&#25214;&#21040;&#20102;&#22359;&#20316;&#29992;&#22495;&#20869;&#30340;&#20989;&#25968;&#22768;&#26126;&#65292;&#36824;&#26159;&#20250;&#36827;&#34892;&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;</td>
<td>&#35813;&#22330;&#21512;&#19979;&#38500;&#20102;&#25214;&#21040; <span class="mw-geshi cpp source-cpp"><span class="kw1">using</span></span> &#22768;&#26126;<br />
&#22806;&#37117;&#19981;&#20877;&#32771;&#34385;&#23454;&#21442;&#20381;&#36182;&#26597;&#25214;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/997.html">CWG 997</a></td>
<td>C++98</td>
<td>&#24453;&#20915;&#30340;&#24418;&#21442;&#31867;&#22411;&#21644;&#36820;&#22238;&#31867;&#22411;&#19981;&#20250;&#34987;&#28155;&#21152;&#21040;&#20989;&#25968;&#27169;&#26495;&#30340;&#21629;&#21517;&#31354;&#38388;&#19982;&#31867;&#30340;&#20851;&#32852;&#38598;</td>
<td>&#23427;&#20204;&#20250;&#34987;&#28155;&#21152;&#21040;&#20851;&#32852;&#38598;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/1690.html">CWG 1690</a></td>
<td>C++98<br />
C++11</td>
<td>ADL &#26080;&#27861;&#25214;&#21040;&#36820;&#22238;&#30340; lambda&#65288;C++11&#65289;&#21644;&#23616;&#37096;&#31867;&#31867;&#22411;&#23545;&#35937;&#65288;C++98&#65289;</td>
<td>&#29616;&#22312;&#21487;&#20197;&#25214;&#21040;&#23427;&#20204;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/1691.html">CWG 1691</a></td>
<td>C++11</td>
<td>ADL &#23545;&#19981;&#21487;&#35265;&#26522;&#20030;&#22768;&#26126;&#30340;&#34892;&#20026;&#20986;&#20154;&#24847;&#26009;</td>
<td>&#24050;&#20462;&#27491;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/1692.html">CWG 1692</a></td>
<td>C++98</td>
<td>&#21452;&#37325;&#23884;&#22871;&#31867;&#27809;&#26377;&#20851;&#32852;&#30340;&#21629;&#21517;&#31354;&#38388;&#65288;&#23427;&#20204;&#30340;&#22806;&#22260;&#31867;&#19981;&#26159;&#21629;&#21517;&#31354;&#38388;&#25104;&#21592;&#65289;</td>
<td>&#20851;&#32852;&#21629;&#21517;&#31354;&#38388;&#25193;&#23637;&#21040;<br />
&#26368;&#20869;&#23618;&#22806;&#22260;&#21629;&#21517;&#31354;&#38388;</td>
</tr>
<tr>
<td><a rel="nofollow" class="external text" href="https://cplusplus.github.io/CWG/issues/2857.html">CWG 2857</a></td>
<td>C++98</td>
<td>&#19981;&#23436;&#25972;&#31867;&#31867;&#22411;&#30340;&#20851;&#32852;&#31867;&#20063;&#20250;&#21253;&#21547;&#23427;&#30340;&#22522;&#31867;</td>
<td>&#19981;&#21253;&#21547;</td>
</tr>
</table>
<h3><span class="mw-headline" id=".E5.8F.82.E9.98.85">&#21442;&#38405;</span></h3>
<ul>
<li><a href="cpp-language-lookup.html">&#21517;&#23383;&#26597;&#25214;</a></li>
<li><a href="cpp-language-function_template.html">&#27169;&#26495;&#23454;&#21442;&#25512;&#23548;</a></li>
<li><a href="cpp-language-overload_resolution.html">&#37325;&#36733;&#20915;&#35758;</a></li>
</ul>
<h3><span class="mw-headline" id=".E5.A4.96.E9.83.A8.E9.93.BE.E6.8E.A5">&#22806;&#37096;&#38142;&#25509;</span></h3>
<table style="border-top:solid 1px;border-bottom:none;border-left:none;border-right:none;">
<tr>
<td>
<ol class="references">
<li id="cite_note-1"><span class="mw-cite-backlink"><a href="cpp-language-adl.html#cite_ref-1">&uarr;</a></span> <span class="reference-text">Andrew Koenig: <a rel="nofollow" class="external text" href="https://www.drdobbs.com/cpp/a-personal-note-about-argument-dependent/232901443">&quot;A Personal Note About Argument-Dependent Lookup&quot;</a></span></li>
<li id="cite_note-2"><span class="mw-cite-backlink"><a href="cpp-language-adl.html#cite_ref-2">&uarr;</a></span> <span class="reference-text">H. Sutter (1998) <a rel="nofollow" class="external text" href="http://www.gotw.ca/publications/mill02.htm">&quot;What&#39;s In a Class? - The Interface Principle&quot;</a> in C++ Report, 10(3)</span></li>
</ol>
</td>
</tr>
</table>
</div>
<div class="visualClear"></div>
</div>
</div>
</div>
</body>
</html>
